tests/load/profitGraph.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 60        # run for 60 seconds
      arrivalRate: 10     # 10 new requests per second
  defaults:
    headers:
      Content-Type: application/json
scenarios:
  - name: "Profit Graph Snapshot Load Test"
    flow:
      - get:
          url: "/api/profit-graph/snapshot"